Revit 2027 API
BuiltInFailures.GroupFailures.AtomTouchedNotAllowedDelete Property
 Changes to groups are only allowed during Edit Group mode. Use Edit Group to make this change.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AtomTouchedNotAllowedDelete { get; }
Public Shared ReadOnly Property AtomTouchedNotAllowedDelete As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AtomTouchedNotAllowedDelete {
	FailureDefinitionId^ get ();
}
static member AtomTouchedNotAllowedDelete : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GroupFailures Class
Autodesk.Revit.DB Namespace